app/controllers/users_controller.rb

  def create
     @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("updated_at", "avatar", "email", "created_at") VALUES('2010-07-09 10:26:24', 'abu.jpg', 'wangzongliang@glorisun.com', '2010-07-09 10:26:24')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 2)
UPDATE "users" SET "avatar" = '____.jpg', "updated_at" = '2010-07-09 10:29:22' WHERE "id" = 2